{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "embedding_1/embeddings", "shape": [20000, 100], "dtype": "float32"}, {"name": "lstm_1/kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [400], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [100, 1], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32"}]}]}